In [1]:
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [2]:
from sci378 import *

Version 0.0.3

In [10]:
ls data

FluNetInteractiveReport.csv      measles_hagelloch_1861.xlsx
N_seaice_extent_daily_v3.0.csv   new_info.xlsx
Pennies.xlsx                     station_info.xlsx
berkeley.txt                     station_list.txt
crichton/                        station_temperature_data.csv.gz
ligo_L1.xlsx                     temperature.txt
linear_data.csv                  v4.mean_GISS_homogenized.txt.gz
linear_data.xls                  v4.temperature.inv.txt

In [11]:
ls data/crichton

berkeley.csv  pasadena.csv

In [12]:
from glob import glob

In [13]:
glob('data/*.xls')

['data/linear_data.xls']

In [14]:
glob('data/*.csv')

['data/N_seaice_extent_daily_v3.0.csv',
 'data/linear_data.csv',
 'data/FluNetInteractiveReport.csv']

In [15]:
glob('data/*.xlsx')

['data/new_info.xlsx',
 'data/ligo_L1.xlsx',
 'data/station_info.xlsx',
 'data/Pennies.xlsx',
 'data/measles_hagelloch_1861.xlsx']

In [17]:
glob('data/*.xls*')

['data/linear_data.xls',
 'data/new_info.xlsx',
 'data/ligo_L1.xlsx',
 'data/station_info.xlsx',
 'data/Pennies.xlsx',
 'data/measles_hagelloch_1861.xlsx']

In [21]:
fnames=glob('data/*.xlsx')

In [23]:
for filename in fnames:
    print(filename)
    data=pd.read_excel(filename)
    display(data.head())

data/new_info.xlsx

,Unnamed: 0,Station,m,brightness,longitude,latitude,elevation
0,0,SAVE,0.024952,45.0,11.8667,57.7667,18.0
1,1,SHARJAH_INTER_AIRP,-0.001723,39.0,55.5170,25.3330,34.0
2,2,RAS_AL_KHAIMAH_INTE,0.018616,17.0,55.9330,25.6170,31.0
3,3,DUBAI_INTL,0.012132,104.0,55.3640,25.2550,10.4
4,4,ABU_DHABI_BATEEN_AIR,0.037361,114.0,54.4700,24.4300,3.0

data/ligo_L1.xlsx

   time (seconds)  strain (*1e21)
0        0.250000       -0.119261
1        0.250061       -0.132130
2        0.250122       -0.144953
3        0.250183       -0.157557
4        0.250244       -0.169775

data/station_info.xlsx

,Unnamed: 0,ID,Station,Latitude,Longitude,Brightness,Elevation
0,0,ACW00011604,SAVE,57.7667,11.8667,45.0,18.0
1,1,AE000041196,SHARJAH_INTER_AIRP,25.3330,55.5170,39.0,34.0
2,2,AEM00041184,RAS_AL_KHAIMAH_INTE,25.6170,55.9330,17.0,31.0
3,3,AEM00041194,DUBAI_INTL,25.2550,55.3640,104.0,10.4
4,4,AEM00041216,ABU_DHABI_BATEEN_AIR,24.4300,54.4700,114.0,3.0

data/Pennies.xlsx

   Year  Number of Pennies  Mass (g)  Height (cm)  Diameter (cm)
0  1960                  3       9.4        0.452          1.902
1  1961                  6      18.5        0.874          1.902
2  1962                  4      12.7        0.694          1.902
3  1963                  5      15.6        0.860          1.902
4  1964                 15      46.5        2.242          1.902

data/measles_hagelloch_1861.xlsx

,Column1,case_ID,infector,day,date_of_prodrome,date_of_rash,date_of_death,age,gender,family_ID,class,complications,x_loc,y_loc
0,1,1,45,22,-39487,-39483,NaN,7,f,41,1,yes,142.5,100.0
1,2,2,45,24,-39485,-39481,NaN,6,f,41,1,yes,142.5,100.0
2,3,3,172,29,-39480,-39476,NaN,4,f,41,0,yes,142.5,100.0
3,4,4,180,28,-39481,-39480,NaN,13,m,61,2,yes,165.0,102.5
4,5,5,45,23,-39486,-39481,NaN,8,f,42,1,yes,145.0,120.0

In [24]:
data=pd.read_csv('data/temperature.txt',delim_whitespace=True)
data

     Year  Annual_Mean 5-year_Mean
0    1882        -0.08       -0.16
1    1883        -0.19       -0.19
2    1884        -0.26       -0.22
3    1885        -0.30       -0.27
4    1886        -0.29       -0.27
..    ...          ...         ...
129  2011         0.60        0.65
130  2012         0.63        0.67
131  2013         0.65        0.70
132  2014         0.74           *
133  2015         0.87           *

[134 rows x 3 columns]

In [28]:
data['Annual_Mean']=data['Annual_Mean']/10

In [29]:
data

     Year  Annual_Mean 5-year_Mean
0    1882       -0.008       -0.16
1    1883       -0.019       -0.19
2    1884       -0.026       -0.22
3    1885       -0.030       -0.27
4    1886       -0.029       -0.27
..    ...          ...         ...
129  2011        0.060        0.65
130  2012        0.063        0.67
131  2013        0.065        0.70
132  2014        0.074           *
133  2015        0.087           *

[134 rows x 3 columns]